avr-rust/avrd/packs/xmegaa/ATxmega64A3.atdf
      <value-group caption="Double buffering mode" name="DMA_DBUFMODE">
        <value caption="Double buffering disabled" name="DISABLED" value="0x00"/>
        <value caption="Double buffering enabled on channel 0/1" name="CH01" value="0x01"/>
        <value caption="Double buffering enabled on channel 2/3" name="CH23" value="0x02"/>
        <value caption="Double buffering enabled on ch. 0/1 and ch. 2/3" name="CH01CH23" value="0x03"/>
      </value-group>
      <value-group caption="Priority mode" name="DMA_PRIMODE">
        <value caption="Round Robin" name="RR0123" value="0x00"/>
        <value caption="Channel 0 &gt; Round Robin on channel 1/2/3" name="CH0RR123" value="0x01"/>
        <value caption="Channel 0 &gt; channel 1 &gt; Round Robin on channel 2/3" name="CH01RR23" value="0x02"/>
        <value caption="Channel 0 &gt; channel 1 &gt; channel 2 &gt; channel 3" name="CH0123" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="DMA_CH_ERRINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="DMA_CH_TRNINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="DMA">
        <interrupt index="0" name="CH0" caption="Channel 0 Interrupt"/>
        <interrupt index="1" name="CH1" caption="Channel 1 Interrupt"/>
        <interrupt index="2" name="CH2" caption="Channel 2 Interrupt"/>
        <interrupt index="3" name="CH3" caption="Channel 3 Interrupt"/>
      </interrupt-group>
    </module><module name="EVSYS" id="I6061" caption="Event System">
      <register-group caption="Event System" name="EVSYS" size="18">
        <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
          <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
          <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
          <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
          <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 4 Multiplexer" name="CH4MUX" offset="0x04" size="1">
          <bitfield caption="Event Channel 4 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 5 Multiplexer" name="CH5MUX" offset="0x05" size="1">
          <bitfield caption="Event Channel 5 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 6 Multiplexer" name="CH6MUX" offset="0x06" size="1">
          <bitfield caption="Event Channel 6 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 7 Multiplexer" name="CH7MUX" offset="0x07" size="1">
          <bitfield caption="Event Channel 7 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Channel 0 Control Register" name="CH0CTRL" offset="0x08" size="1">
          <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM"/>
          <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
          <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 1 Control Register" name="CH1CTRL" offset="0x09" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 2 Control Register" name="CH2CTRL" offset="0x0A" size="1">
          <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM" values="EVSYS_QDIRM"/>
          <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
          <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 3 Control Register" name="CH3CTRL" offset="0x0B" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 4 Control Register" name="CH4CTRL" offset="0x0C" size="1">
          <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM" values="EVSYS_QDIRM"/>
          <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
          <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 5 Control Register" name="CH5CTRL" offset="0x0D" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 6 Control Register" name="CH6CTRL" offset="0x0E" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 7 Control Register" name="CH7CTRL" offset="0x0F" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Event Strobe" name="STROBE" offset="0x10" size="1"/>
